Importation des bibliothèques pandas et numpy

#Partie 1 : Chargement et exploration du dataset

In [10]:
import pandas as pd
import numpy as np
df=pd.read_csv('employees2 (1).csv')
print(df)
print(df.head(5))
print(df.info())
print(df.isnull().sum())

    Unnamed: 0   ID     Name   Age   Salary Department  Years_Experience  \
0            0    1  Othmane   NaN      NaN         IT                 0
1            1    2    Ikram  22.0      NaN         HR                23
2            2    3      Bob   NaN      NaN         HR                26
3            3    4    Zineb  59.0  73665.0         HR                 3
4            4    5    David  57.0  59325.0    Finance                33
..         ...  ...      ...   ...      ...        ...               ...
95          95   96      Bob   NaN  82670.0  Marketing                21
96          96   97      Eva   NaN  59838.0    Finance                12
97          97   98   Nassim   NaN  45811.0    Finance                14
98          98   99   Nassim  42.0  73800.0  Marketing                13
99          99  100  Othmane  32.0      NaN  Marketing                19

   Remote
0     Yes
1     Yes
2     Yes
3      No
4      No
..    ...
95    Yes
96     No
97    Yes
98    Yes
99    Yes

[100 rows x 8 columns]
   Unnamed: 0  ID     Name   Age   Salary Department  Years_Experience Remote
0           0   1  Othmane   NaN      NaN         IT                 0    Yes
1           1   2    Ikram  22.0      NaN         HR                23    Yes
2           2   3      Bob   NaN      NaN         HR                26    Yes
3           3   4    Zineb  59.0  73665.0         HR                 3     No
4           4   5    David  57.0  59325.0    Finance                33     No
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        100 non-null    int64
 1   ID                100 non-null    int64
 2   Name              100 non-null    object
 3   Age               51 non-null     float64
 4   Salary            56 non-null     float64
 5   Department        100 non-null    object
 6   Years_Experience  100 non-null    int64
 7   Remote            100 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 6.4+ KB
None
Unnamed: 0           0
ID                   0
Name                 0
Age                 49
Salary              44
Department           0
Years_Experience     0
Remote               0
dtype: int64

# Partie 2 : Nettoyage des données

In [22]:
df.Age=df.Age.fillna(df.Age.median())
df=df.sort_values(by='Department')
df['Salary']=df['Salary'].fillna(df.groupby('Department')['Salary'].transform('mean'))
print(df)

#df.Salary=df.Salary.fillna(df.Salary.mean())
#print(df.isnull().sum())

    Unnamed: 0   ID     Name   Age        Salary Department  Years_Experience  \
65          65   66    Alice  45.0  45959.000000    Finance                10
8            8    9    Ikram  45.0  57836.583333    Finance                15
33          33   34     Reda  33.0  49644.000000    Finance                33
57          57   58      Bob  52.0  57836.583333    Finance                 6
25          25   26    David  45.0  83996.000000    Finance                30
..         ...  ...      ...   ...           ...        ...               ...
98          98   99   Nassim  42.0  73800.000000  Marketing                13
78          78   79    Nawal  56.0  69956.000000  Marketing                28
47          47   48    Alice  25.0  63836.000000  Marketing                19
95          95   96      Bob  45.0  82670.000000  Marketing                21
99          99  100  Othmane  32.0  70395.153846  Marketing                19

   Remote
65     No
8      No
33    Yes
57     No
25     No
..    ...
98    Yes
78     No
47    Yes
95    Yes
99    Yes

[100 rows x 8 columns]

In [ ]:
df.ID=df.ID.astype(int)
df['Salary']=df['Salary'].astype(float)
df.Age=df.Age.astype(int)
df.Years_Experience=df.Years_Experience.astype(int)

In [ ]:
df['Remote'].replace({'Yes': 'Oui', 'No': 'Non'}, inplace=True)
print(df)

    Unnamed: 0   ID     Name  Age        Salary Department  Years_Experience  \
65          65   66    Alice   45  45959.000000    Finance                10
8            8    9    Ikram   45  57836.583333    Finance                15
33          33   34     Reda   33  49644.000000    Finance                33
57          57   58      Bob   52  57836.583333    Finance                 6
25          25   26    David   45  83996.000000    Finance                30
..         ...  ...      ...  ...           ...        ...               ...
98          98   99   Nassim   42  73800.000000  Marketing                13
78          78   79    Nawal   56  69956.000000  Marketing                28
47          47   48    Alice   25  63836.000000  Marketing                19
95          95   96      Bob   45  82670.000000  Marketing                21
99          99  100  Othmane   32  70395.153846  Marketing                19

   Remote
65    Non
8     Non
33    Oui
57    Non
25    Non
..    ...
98    Oui
78    Non
47    Oui
95    Oui
99    Oui

[100 rows x 8 columns]

In [29]:
df['Ancienneté_Catégorie']=df['Years_Experience'].apply(lambda x: 'Junior' if x < 3 else ('Intermédiaire' if x < 6 else ('Senior'if 8<x<15 else 'Expert')))
print(df)

    Unnamed: 0   ID     Name  Age        Salary Department  Years_Experience  \
65          65   66    Alice   45  45959.000000    Finance                10
8            8    9    Ikram   45  57836.583333    Finance                15
33          33   34     Reda   33  49644.000000    Finance                33
57          57   58      Bob   52  57836.583333    Finance                 6
25          25   26    David   45  83996.000000    Finance                30
..         ...  ...      ...  ...           ...        ...               ...
98          98   99   Nassim   42  73800.000000  Marketing                13
78          78   79    Nawal   56  69956.000000  Marketing                28
47          47   48    Alice   25  63836.000000  Marketing                19
95          95   96      Bob   45  82670.000000  Marketing                21
99          99  100  Othmane   32  70395.153846  Marketing                19

   Remote Ancienneté_Catégorie
65    Non               Senior
8     Non               Expert
33    Oui               Expert
57    Non               Expert
25    Non               Expert
..    ...                  ...
98    Oui               Senior
78    Non               Expert
47    Oui               Expert
95    Oui               Expert
99    Oui               Expert

[100 rows x 9 columns]

# Partie 3 : Analyses exploratoires et statistiques

In [ ]:
sal_moyen= df['Salary'].mean()
print(f"Le salaire moyen globale est de {sal_moyen:.2f} ")

Le salaire moyen est de 64504.14

In [31]:
sal_plus=df.Salary.max()
print(f"Le salaire le plus élevé est de {sal_plus:.2f} ")

Le salaire le plus élevé est de 84685.00

In [32]:
df1=df.groupby('Ancienneté_Catégorie')['Salary'].transform('mean')
print(df1)

65    64608.816168
8     64255.825622
33    64255.825622
57    64255.825622
25    64255.825622
          ...
98    64608.816168
78    64255.825622
47    64255.825622
95    64255.825622
99    64255.825622
Name: Salary, Length: 100, dtype: float64